:PROPERTIES:
:ID:       5885f3b1-cd67-4101-b903-ceaed4f94321
:END:
#+TITLE: Nixos: Comparing Module Structures
#+CATEGORY: slips
#+TAGS:

* Flake JSON

There doesn't seem to be an authoritative JSON schema for flakes.

** Schema

From =nix flake info --json | jq .= in [[https://github.com/hlissner/dotfiles][hlissner/dotfiles]]

#+begin_src shell :results output verbatim

#+end_src



** check-jsonschema

With [[https://git.clan.lol/clan/clan-core/src/branch/main/lib/jsonschema/default.nix][clan/clan-core/src/branch/main/lib/jsonschema/default.nix]]

#+begin_src shell :results output verbatim
f="$(mktemp -f jsonschema-XXXXXX.nix)"
u="https://git.clan.lol/clan/clan-core/raw/branch/main/lib/jsonschema/default.nix"

curl $u > $f
#+end_src

Then prefixing =fdsa== and pasting =$f= into a nix repl ... um gives
me a function, but idk how to run it...

Not sure how to =nix repl -f <check-jsonschema>= without adding =clan=
to a flake. Seems too complex anyways.

* Dotfiles
** Flakes

#+begin_src shell :results output verbatim
locate -r '/data/ecto/x.files/.*flake.\(nix\|lock\)' \
    | sed -E 's/.*x.files\///g' \
    | sort | uniq | tree --fromfile .
#+end_src

#+RESULTS:
#+begin_example
.
├── akirak
│   └── emacs2
│       ├── flake.lock
│       ├── flake.nix
│       ├── lock
│       │   ├── flake.lock
│       │   └── flake.nix
│       ├── nix
│       │   └── presets
│       │       └── default
│       │           └── flake.nix
│       └── partitions
│           └── checks
│               ├── flake.lock
│               └── flake.nix
├── alyraffauf
│   ├── bazznix
│   │   ├── flake.lock
│   │   └── flake.nix
│   ├── nixcfg
│   │   ├── flake.lock
│   │   └── flake.nix
│   └── secrets
│       ├── flake.lock
│       └── flake.nix
├── aylur
│   └── dotfiles
│       ├── flake.lock
│       └── flake.nix
├── benmezger
│   └── dotfiles
│       ├── flake.lock
│       └── flake.nix
├── budimanjojo
│   └── nix-config
│       ├── flake.lock
│       └── flake.nix
├── gtrunsec
│   └── dotfiles
│       ├── flake.lock
│       └── flake.nix
├── hlissner
│   └── dotfiles
│       ├── flake.lock
│       └── flake.nix
├── jessfraz
│   └── dotfiles
│       ├── flake.lock
│       └── flake.nix
├── jjba23
│   └── dotfiles
│       └── resources
│           └── flakes
│               ├── haskell-dev
│               │   ├── flake.lock
│               │   └── flake.nix
│               └── scala-dev
│                   ├── flake.lock
│                   └── flake.nix
├── jsoo1
│   └── dotfiles
│       └── nix
│           ├── flake.lock
│           └── flake.nix
├── kitnil
│   └── dotfiles
│       ├── dotfiles
│       │   ├── dns
│       │   │   ├── flake.lock
│       │   │   └── flake.nix
│       │   ├── docker
│       │   │   ├── nixos
│       │   │   │   ├── flake.lock
│       │   │   │   └── flake.nix
│       │   │   └── tor-bridges
│       │   │       ├── flake.lock
│       │   │       └── flake.nix
│       │   ├── firefox
│       │   │   ├── flake.lock
│       │   │   └── flake.nix
│       │   ├── libvirt
│       │   │   └── xml-patch
│       │   │       ├── flake.lock
│       │   │       └── flake.nix
│       │   ├── maintenance
│       │   │   ├── github
│       │   │   │   ├── flake.lock
│       │   │   │   └── flake.nix
│       │   │   └── gitlab
│       │   │       ├── flake.lock
│       │   │       └── flake.nix
│       │   └── nix
│       │       ├── 3proxy
│       │       │   ├── flake.lock
│       │       │   └── flake.nix
│       │       ├── bird
│       │       │   ├── flake.lock
│       │       │   └── flake.nix
│       │       ├── container-systemd
│       │       │   ├── flake.lock
│       │       │   └── flake.nix
│       │       ├── container-systemd-builder
│       │       │   ├── flake.lock
│       │       │   └── flake.nix
│       │       ├── container-systemd-taskexecutor
│       │       │   ├── flake.lock
│       │       │   └── flake.nix
│       │       ├── flake.lock
│       │       ├── flake.nix
│       │       ├── openvpn
│       │       │   ├── flake.lock
│       │       │   └── flake.nix
│       │       ├── tinyproxy
│       │       │   ├── flake.lock
│       │       │   └── flake.nix
│       │       ├── vendir
│       │       │   ├── flake.lock
│       │       │   └── flake.nix
│       │       └── yggdrasil
│       │           ├── flake.lock
│       │           └── flake.nix
│       ├── private_dot_emacs.d
│       │   └── insert
│       │       └── nix
│       │           └── flake.nix
│       ├── src
│       │   └── nix
│       │       └── vosk
│       │           ├── flake.lock
│       │           └── flake.nix
│       └── vosk
│           ├── flake.lock
│           └── flake.nix
├── maximbaz
│   └── dotfiles
│       ├── flake.lock
│       └── flake.nix
├── michal_atlas
│   └── dotfiles
│       ├── flake.lock
│       └── flake.nix
├── purplg
│   └── dotfiles
│       └── dot-config
│           └── home-manager
│               ├── flake.lock
│               └── flake.nix
├── rasendubi
│   └── emacs
│       ├── flake.lock
│       └── flake.nix
├── .repo
│   └── projects
│       └── alyraffauf
│           └── bazznix.git
│               └── logs
│                   └── refs
│                       └── remotes
│                           └── github
│                               └── update_flake_lock_action
├── youngker
│   └── nix
│       ├── flake.lock
│       ├── flake.nix
│       └── templates
│           ├── android
│           │   └── flake.nix
│           ├── cpp
│           │   └── flake.nix
│           └── rust
│               └── flake.nix
└── zaney
    ├── zaneyos
    │   ├── flake.lock
    │   └── flake.nix
    └── zaney-sync
        └── flake.lock

91 directories, 87 files
#+end_example

** Modules

#+begin_src shell :results output verbatim
locate '/data/ecto/x.files/*.nix' \
    | sed -E 's/.*x.files\/(.*)\/.*\.nix/\1/g' \
    | sort | uniq | tree --fromfile .
#+end_src

#+RESULTS:
#+begin_example
.
├── akirak
│   └── emacs2
│       ├── lock
│       ├── modules
│       ├── nix
│       │   ├── lib
│       │   ├── presets
│       │   │   └── default
│       │   └── twist
│       └── partitions
│           └── checks
├── alyraffauf
│   ├── bazznix
│   │   ├── common
│   │   ├── disko
│   │   ├── homes
│   │   │   └── aly
│   │   ├── hosts
│   │   │   └── pacifidlog
│   │   ├── hwModules
│   │   │   ├── asus
│   │   │   │   └── tuf
│   │   │   │       └── a16
│   │   │   │           └── amd-7030
│   │   │   ├── common
│   │   │   │   ├── bluetooth
│   │   │   │   ├── cpu
│   │   │   │   │   ├── amd
│   │   │   │   │   └── intel
│   │   │   │   ├── gaming
│   │   │   │   ├── gpu
│   │   │   │   │   ├── amd
│   │   │   │   │   └── intel
│   │   │   │   ├── laptop
│   │   │   │   └── ssd
│   │   │   ├── framework
│   │   │   │   └── 13
│   │   │   │       ├── amd-7000
│   │   │   │       └── intel-11th
│   │   │   └── lenovo
│   │   │       └── legion
│   │   │           └── go
│   │   ├── nixosModules
│   │   │   ├── apps
│   │   │   │   ├── emudeck
│   │   │   │   ├── podman
│   │   │   │   └── steam
│   │   │   ├── desktop
│   │   │   │   └── kde
│   │   │   ├── services
│   │   │   │   └── flatpak
│   │   │   └── shell
│   │   ├── overlays
│   │   ├── pkgs
│   │   ├── secrets
│   │   └── userModules
│   │       └── aly
│   ├── nixcfg
│   │   ├── homes
│   │   │   ├── aly
│   │   │   └── dustin
│   │   ├── hosts
│   │   │   ├── dewford
│   │   │   ├── evergrande
│   │   │   ├── fallarbor
│   │   │   ├── fortree
│   │   │   ├── lavaridge
│   │   │   ├── lilycove
│   │   │   ├── littleroot
│   │   │   ├── mauville
│   │   │   ├── mossdeep
│   │   │   ├── oldale
│   │   │   ├── petalburg
│   │   │   ├── rustboro
│   │   │   ├── slateport
│   │   │   ├── sootopolis
│   │   │   └── verdanturf
│   │   ├── modules
│   │   │   ├── darwin
│   │   │   │   ├── profiles
│   │   │   │   │   └── base
│   │   │   │   └── programs
│   │   │   │       └── nix
│   │   │   ├── home
│   │   │   │   ├── aly
│   │   │   │   │   ├── desktop
│   │   │   │   │   │   ├── gnome
│   │   │   │   │   │   ├── hyprland
│   │   │   │   │   │   └── macos
│   │   │   │   │   ├── profiles
│   │   │   │   │   │   └── mail
│   │   │   │   │   ├── programs
│   │   │   │   │   │   ├── awscli
│   │   │   │   │   │   ├── chromium
│   │   │   │   │   │   ├── firefox
│   │   │   │   │   │   │   └── betterfox
│   │   │   │   │   │   ├── git
│   │   │   │   │   │   ├── halloy
│   │   │   │   │   │   ├── helix
│   │   │   │   │   │   ├── rbw
│   │   │   │   │   │   ├── ssh
│   │   │   │   │   │   ├── thunderbird
│   │   │   │   │   │   ├── vesktop
│   │   │   │   │   │   ├── vsCode
│   │   │   │   │   │   ├── zed-editor
│   │   │   │   │   │   └── zen
│   │   │   │   │   └── services
│   │   │   │   │       └── icloud
│   │   │   │   ├── desktop
│   │   │   │   │   ├── aerospace
│   │   │   │   │   ├── cosmic
│   │   │   │   │   ├── gnome
│   │   │   │   │   ├── hyprland
│   │   │   │   │   └── kde
│   │   │   │   ├── profiles
│   │   │   │   │   ├── defaultApps
│   │   │   │   │   └── shell
│   │   │   │   ├── programs
│   │   │   │   │   ├── fastfetch
│   │   │   │   │   ├── ghostty
│   │   │   │   │   └── rofi
│   │   │   │   └── services
│   │   │   │       ├── gammastep
│   │   │   │       ├── hypridle
│   │   │   │       ├── mako
│   │   │   │       ├── raycast
│   │   │   │       ├── swayosd
│   │   │   │       └── waybar
│   │   │   ├── nixos
│   │   │   │   ├── disko
│   │   │   │   │   ├── btrfs-subvolumes
│   │   │   │   │   ├── luks-btrfs-subvolumes
│   │   │   │   │   └── lvm-ext4
│   │   │   │   ├── hardware
│   │   │   │   │   ├── amd
│   │   │   │   │   │   ├── cpu
│   │   │   │   │   │   └── gpu
│   │   │   │   │   ├── asus
│   │   │   │   │   │   └── ally
│   │   │   │   │   │       └── RC72LA
│   │   │   │   │   ├── beelink
│   │   │   │   │   │   └── mini
│   │   │   │   │   │       └── s12pro
│   │   │   │   │   ├── framework
│   │   │   │   │   │   └── 13
│   │   │   │   │   │       ├── amd-7000
│   │   │   │   │   │       └── intel-11th
│   │   │   │   │   ├── intel
│   │   │   │   │   │   ├── cpu
│   │   │   │   │   │   └── gpu
│   │   │   │   │   ├── lenovo
│   │   │   │   │   │   ├── thinkcentre
│   │   │   │   │   │   │   └── m700
│   │   │   │   │   │   └── thinkpad
│   │   │   │   │   │       ├── 5D50X
│   │   │   │   │   │       ├── T440p
│   │   │   │   │   │       └── X1
│   │   │   │   │   │           └── gen-9
│   │   │   │   │   ├── nvidia
│   │   │   │   │   │   └── gpu
│   │   │   │   │   └── profiles
│   │   │   │   │       ├── base
│   │   │   │   │       └── laptop
│   │   │   │   ├── locale
│   │   │   │   │   └── en-us
│   │   │   │   ├── os
│   │   │   │   │   ├── desktop
│   │   │   │   │   │   ├── cosmic
│   │   │   │   │   │   ├── gnome
│   │   │   │   │   │   ├── hyprland
│   │   │   │   │   │   └── kde
│   │   │   │   │   ├── profiles
│   │   │   │   │   │   ├── arr
│   │   │   │   │   │   ├── autoUpgrade
│   │   │   │   │   │   ├── backups
│   │   │   │   │   │   ├── base
│   │   │   │   │   │   ├── btrfs
│   │   │   │   │   │   ├── data-share
│   │   │   │   │   │   ├── gaming
│   │   │   │   │   │   ├── hardened
│   │   │   │   │   │   ├── iso
│   │   │   │   │   │   ├── media-share
│   │   │   │   │   │   ├── server
│   │   │   │   │   │   ├── swap
│   │   │   │   │   │   ├── wifi
│   │   │   │   │   │   └── workstation
│   │   │   │   │   ├── programs
│   │   │   │   │   │   ├── firefox
│   │   │   │   │   │   ├── lanzaboote
│   │   │   │   │   │   ├── nicotine-plus
│   │   │   │   │   │   ├── nix
│   │   │   │   │   │   ├── podman
│   │   │   │   │   │   ├── retroarch
│   │   │   │   │   │   ├── steam
│   │   │   │   │   │   ├── systemd-boot
│   │   │   │   │   │   └── virt-manager
│   │   │   │   │   └── services
│   │   │   │   │       ├── alycodes
│   │   │   │   │       ├── caddy
│   │   │   │   │       ├── cosmic-greeter
│   │   │   │   │       ├── fail2ban
│   │   │   │   │       ├── flatpak
│   │   │   │   │       ├── forgejo
│   │   │   │   │       ├── forgejo-runner
│   │   │   │   │       ├── gdm
│   │   │   │   │       ├── greetd
│   │   │   │   │       ├── homebridge
│   │   │   │   │       ├── plex
│   │   │   │   │       ├── prometheusNode
│   │   │   │   │       ├── promtail
│   │   │   │   │       ├── qbittorrent
│   │   │   │   │       ├── sddm
│   │   │   │   │       ├── sunshine
│   │   │   │   │       ├── syncthing
│   │   │   │   │       └── tailscale
│   │   │   │   └── users
│   │   │   │       ├── aly
│   │   │   │       └── dustin
│   │   │   └── snippets
│   │   │       ├── cute-haus
│   │   │       ├── nix
│   │   │       ├── restic
│   │   │       ├── ssh
│   │   │       ├── syncthing
│   │   │       └── tailnet
│   │   └── overlays
│   └── secrets
├── aylur
│   └── dotfiles
│       ├── home
│       ├── nvim
│       ├── scripts
│       └── system
│           ├── macos
│           └── nixos
├── benmezger
│   └── dotfiles
│       ├── home
│       │   ├── common
│       │   ├── default
│       │   │   └── packages
│       │   └── osx
│       ├── hosts
│       │   ├── common
│       │   ├── default
│       │   └── osx
│       ├── modules
│       │   ├── linux
│       │   └── osx
│       ├── overlays
│       ├── pkgs
│       │   └── my-package
│       └── shells
├── blejdfist2
│   └── dotfiles
│       ├── nixos
│       └── nixpkgs-local
│           └── pkgs
│               └── rust-nightly
├── budimanjojo
│   └── nix-config
│       ├── home
│       │   ├── budiman
│       │   │   ├── config
│       │   │   │   └── neovim
│       │   │   ├── hosts
│       │   │   └── profiles
│       │   └── _modules
│       │       ├── browser
│       │       │   └── firefox
│       │       ├── _default
│       │       ├── editor
│       │       │   └── neovim
│       │       ├── homelab
│       │       │   └── kubernetes
│       │       ├── multiplexer
│       │       │   ├── tmux
│       │       │   └── zellij
│       │       ├── programs
│       │       │   ├── beeaccounting
│       │       │   ├── chezmoi
│       │       │   ├── fontconfig
│       │       │   ├── go
│       │       │   ├── obs-studio
│       │       │   ├── qmk
│       │       │   └── yamllint
│       │       ├── services
│       │       │   └── nextcloud-client
│       │       ├── shell
│       │       │   ├── dircolors
│       │       │   ├── fish
│       │       │   ├── git
│       │       │   ├── lf
│       │       │   ├── nix-direnv
│       │       │   └── starship
│       │       ├── terminal-emulator
│       │       │   ├── alacritty
│       │       │   ├── contour
│       │       │   ├── kitty
│       │       │   └── wezterm
│       │       └── windowmanager
│       │           ├── add-on
│       │           │   ├── blueman-applet
│       │           │   ├── dunst
│       │           │   ├── gtk-theme
│       │           │   ├── nm-applet
│       │           │   ├── nwg-bar
│       │           │   ├── pasystray
│       │           │   ├── picom
│       │           │   ├── py3status
│       │           │   ├── rofi
│       │           │   ├── screenshotter
│       │           │   ├── swayidle
│       │           │   ├── swaylock
│       │           │   ├── terminal-emulator
│       │           │   ├── theme
│       │           │   │   └── tokyonight
│       │           │   ├── waybar
│       │           │   └── xdg
│       │           ├── hyprland
│       │           │   └── config
│       │           ├── i3
│       │           │   └── config
│       │           └── sway
│       │               └── config
│       ├── lib
│       ├── overlays
│       ├── packages
│       │   ├── configure-gtk
│       │   ├── fish-plugins
│       │   ├── krr
│       │   ├── kubectl-rook-ceph
│       │   ├── nvim-plugins
│       │   ├── _sources
│       │   ├── tokyonight-gtk-theme
│       │   └── tokyonight-icon-theme
│       └── system
│           ├── hosts
│           │   ├── budimanjojo-firewall
│           │   │   └── _modules
│           │   │       ├── firewall
│           │   │       └── services
│           │   │           ├── adguardhome
│           │   │           ├── chrony
│           │   │           ├── fireqos
│           │   │           ├── frr
│           │   │           ├── kea
│           │   │           ├── omada-controller
│           │   │           ├── powerdns
│           │   │           ├── rsyslogd
│           │   │           └── tdarr
│           │   ├── budimanjojo-main
│           │   ├── budimanjojo-nas
│           │   │   └── _modules
│           │   ├── budimanjojo-oracle
│           │   │   └── _modules
│           │   │       └── services
│           │   │           └── blocky
│           │   └── nixos-livecd
│           ├── _modules
│           │   ├── containers
│           │   │   └── beeaccounting
│           │   ├── _default
│           │   ├── displaymanager
│           │   │   └── sddm
│           │   ├── monitoring
│           │   │   ├── node-exporter
│           │   │   └── smartctl-exporter
│           │   ├── programs
│           │   │   ├── adb
│           │   │   ├── hugo
│           │   │   ├── msmtp
│           │   │   ├── nh
│           │   │   └── qmk
│           │   ├── services
│           │   │   ├── btrfs-autoscrub
│           │   │   ├── grafana
│           │   │   ├── openssh
│           │   │   ├── prometheus
│           │   │   └── restic-backup
│           │   ├── system
│           │   │   ├── autoupgrade
│           │   │   ├── bootloader
│           │   │   ├── cpu
│           │   │   ├── font
│           │   │   ├── sound
│           │   │   └── video
│           │   └── windowmanager
│           │       ├── add-on
│           │       │   ├── blueman
│           │       │   ├── gnome-keyring
│           │       │   ├── networkmanager
│           │       │   ├── polkit-gnome
│           │       │   └── thunar
│           │       ├── hyprland
│           │       ├── i3
│           │       └── sway
│           ├── profiles
│           └── pubkeys
├── cjbassi
│   └── dotfiles
├── dcunited001
│   └── dotfiles
│       └── nixos
│           ├── hosts
│           │   └── kratos
│           └── modules
│               ├── services
│               └── users
├── gtrunsec
│   └── dotfiles
│       ├── cachix
│       ├── compat
│       ├── hosts
│       │   └── hardware
│       ├── lib
│       ├── local
│       ├── modules
│       │   ├── adguardhome
│       │   ├── filestash
│       │   ├── ids
│       │   │   └── zeek
│       │   ├── promnesia
│       │   └── vast
│       ├── overlays
│       ├── pkgs
│       │   ├── appimage
│       │   ├── go
│       │   │   ├── got
│       │   │   ├── govet
│       │   │   └── horcrux
│       │   ├── kepler.gl
│       │   ├── misc
│       │   ├── my-node-packages
│       │   ├── notdeft
│       │   ├── python
│       │   │   ├── HPI
│       │   │   ├── orgparse
│       │   │   └── promnesia
│       │   └── rust
│       │       └── sudo_pair
│       ├── profiles
│       │   ├── applications
│       │   │   ├── chat
│       │   │   ├── img
│       │   │   └── misc
│       │   ├── code
│       │   ├── core
│       │   ├── data
│       │   ├── devices
│       │   ├── fonts
│       │   ├── graphical
│       │   │   └── misc
│       │   ├── network
│       │   ├── nsm
│       │   ├── search
│       │   ├── ssh
│       │   └── virt
│       └── users
│           ├── nixos
│           ├── profiles
│           │   ├── alacritty
│           │   ├── direnv
│           │   └── git
│           └── root
├── hlissner
│   └── dotfiles
│       ├── config
│       │   └── secrets
│       ├── hosts
│       │   ├── harusame
│       │   │   └── secrets
│       │   ├── ramen
│       │   │   └── secrets
│       │   └── udon
│       │       └── secrets
│       ├── lib
│       ├── modules
│       │   ├── desktop
│       │   │   ├── apps
│       │   │   ├── browsers
│       │   │   ├── media
│       │   │   └── term
│       │   ├── dev
│       │   ├── editors
│       │   ├── profiles
│       │   │   ├── hardware
│       │   │   │   ├── cpu
│       │   │   │   ├── gpu
│       │   │   │   ├── pc
│       │   │   │   └── wacom
│       │   │   ├── network
│       │   │   ├── platform
│       │   │   ├── role
│       │   │   └── user
│       │   ├── services
│       │   ├── shell
│       │   ├── system
│       │   ├── themes
│       │   │   └── autumnal
│       │   └── virt
│       └── packages
│           └── rofi-blocks
├── isti115
│   └── dotfiles
├── jessfraz
│   └── dotfiles
├── jethrokuan
│   ├── dotfiles
│   └── org
├── jjba23
│   └── dotfiles
│       └── resources
│           └── flakes
│               ├── haskell-dev
│               └── scala-dev
├── jsoo1
│   └── dotfiles
│       └── nix
│           └── overlays
├── kitnil
│   └── dotfiles
│       ├── apps
│       │   └── cluster1
│       │       └── windows-novnc-firefox
│       ├── dot_config
│       │   ├── nix
│       │   └── nixpkgs
│       ├── dotfiles
│       │   ├── dns
│       │   │   └── hosts
│       │   ├── docker
│       │   │   ├── nixos
│       │   │   │   └── hosts
│       │   │   └── tor-bridges
│       │   ├── firefox
│       │   ├── libvirt
│       │   │   └── xml-patch
│       │   ├── maintenance
│       │   │   ├── github
│       │   │   └── gitlab
│       │   ├── mjru
│       │   └── nix
│       │       ├── 3proxy
│       │       ├── bird
│       │       ├── container-systemd
│       │       │   └── hosts
│       │       ├── container-systemd-builder
│       │       │   └── hosts
│       │       ├── container-systemd-taskexecutor
│       │       │   ├── hosts
│       │       │   └── modules
│       │       │       └── services
│       │       ├── firefox
│       │       ├── modules
│       │       │   └── services
│       │       ├── notebook
│       │       ├── openvpn
│       │       ├── pc0
│       │       ├── pkgs
│       │       │   └── nekoray
│       │       ├── tinyproxy
│       │       ├── vendir
│       │       └── yggdrasil
│       ├── private_dot_emacs.d
│       │   └── insert
│       │       └── nix
│       ├── src
│       │   └── nix
│       │       └── vosk
│       └── vosk
├── maximbaz
│   └── dotfiles
│       ├── hosts
│       │   ├── home-manitoba
│       │   └── MMDFLQCPF9676
│       ├── modules
│       │   ├── common
│       │   ├── linux
│       │   └── macos
│       ├── overlay
│       └── util
├── michal_atlas
│   └── dotfiles
│       ├── desktop-home
│       │   └── packages
│       ├── desktop-modules
│       │   └── storage
│       ├── home
│       │   ├── files
│       │   └── programs
│       ├── lib
│       ├── machines
│       │   └── hydra
│       └── modules
│           └── networking
├── purplg
│   └── dotfiles
│       └── dot-config
│           └── home-manager
│               ├── hosts
│               └── modules
│                   └── hyprland
├── rasendubi
│   └── emacs
│       └── naga
├── youngker
│   └── nix
│       ├── darwin
│       ├── home
│       ├── modules
│       │   ├── darwin
│       │   │   ├── skhd
│       │   │   └── yabai
│       │   ├── home
│       │   │   ├── alacritty
│       │   │   ├── amethyst
│       │   │   ├── android
│       │   │   ├── audio
│       │   │   ├── bash
│       │   │   ├── bingwallpaper
│       │   │   ├── clojure
│       │   │   ├── cmake
│       │   │   ├── core
│       │   │   ├── cpp
│       │   │   ├── darwin-settings
│       │   │   ├── dunst
│       │   │   ├── emacs
│       │   │   ├── emacs-daemon
│       │   │   ├── fcitx5
│       │   │   ├── firefox
│       │   │   ├── font
│       │   │   ├── fzf
│       │   │   ├── gdb
│       │   │   ├── git
│       │   │   ├── go
│       │   │   ├── graphic
│       │   │   ├── gtk
│       │   │   ├── guile
│       │   │   ├── haskell
│       │   │   ├── hyprland
│       │   │   ├── jack
│       │   │   ├── java
│       │   │   ├── kime
│       │   │   ├── mpd
│       │   │   ├── nix
│       │   │   ├── ocaml
│       │   │   ├── pandoc
│       │   │   ├── picom
│       │   │   ├── python
│       │   │   ├── qemu
│       │   │   ├── qt
│       │   │   ├── rectangle
│       │   │   ├── rofi
│       │   │   ├── rust
│       │   │   ├── sbcl
│       │   │   ├── starship
│       │   │   ├── texlive
│       │   │   ├── utils
│       │   │   ├── vim
│       │   │   ├── vscode
│       │   │   ├── waybar
│       │   │   ├── webbrowser
│       │   │   ├── xmobar
│       │   │   ├── xmonad
│       │   │   ├── xorg
│       │   │   ├── xterm-24bit
│       │   │   ├── zathura
│       │   │   └── zsh
│       │   └── nixos
│       │       ├── docker
│       │       ├── jack
│       │       ├── nvidia
│       │       ├── openssh
│       │       ├── pipewire
│       │       ├── pulseaudio
│       │       ├── systemd
│       │       ├── timesyncd
│       │       ├── virtualbox
│       │       ├── wayland
│       │       └── xserver
│       ├── nixos
│       │   ├── aarch64
│       │   ├── common
│       │   └── x86_64
│       ├── overlays
│       ├── packages
│       │   └── xterm-24bit
│       └── templates
│           ├── agl
│           ├── android
│           ├── cpp
│           └── rust
└── zaney
    ├── zaneyos
    │   ├── hosts
    │   │   ├── default
    │   │   ├── nixstation
    │   │   └── zaneyos-oem
    │   ├── modules
    │   │   ├── core
    │   │   ├── drivers
    │   │   └── home
    │   │       ├── fastfetch
    │   │       ├── hyprland
    │   │       ├── rofi
    │   │       ├── scripts
    │   │       ├── waybar
    │   │       ├── wlogout
    │   │       ├── yazi
    │   │       └── zsh
    │   └── profiles
    │       ├── amd
    │       ├── intel
    │       ├── nvidia
    │       ├── nvidia-laptop
    │       └── vm
    └── zaney-sync
        ├── dev-shells
        ├── home
        ├── options
        ├── scripts
        ├── system
        └── templates
            ├── home
            ├── scripts
            └── system

225 directories, 503 files
#+end_example

